tasks = {
    "if else":  ["Напишите код, который ищет сумму от 1 до 10, используя циклы", "Задание2"],
    "for":  ["task 1 for","task 2 for","task 3 for"],
    "while": ["task 1 while","task 2 while","task 3 while"],
    "datatypes": ["task 1 datatype","task 2 datatype","task 3 datatype"],
    "strings": ["task 1 string","task 2 string","task 3 string"]
}

theory = {
    "if else": 'Условия *if/else* в Python — это конструкция для принятия решений в программе. Она позволяет выполнять разные блоки кода в зависимости от истинности условий.\n*Основные элементы:*\n*1.if* — проверяет условие, если оно истинно (True), выполняется блок кода после него\n*2.elif (else if)* — проверяет дополнительное условие, если предыдущие условия ложны\n*3.else* — выполняется, если все предыдущие условия ложны',
    "for": 'Оператор for..in также является оператором цикла, который осуществляет итерацию по последовательности объектов, т.е. проходит через каждый элемент в последовательности. Мы узнаем больше о последовательностях в дальнейших главах, а пока просто запомните, что последовательность – это упорядоченный набор элементов.',
    "while": 'w',
    "datatypes": 'a',
    "strings": 's'
}