tasks = {
    "if else":  ["Напишите код, который ищет сумму от 1 до 10, используя циклы", "Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.","Дано число. Проверьте, четное оно или нет."],
    "for":  ["Напишите программу, которая выводит фразу Hello world! 5 раз, используя цикл for.","Допустим, нам нужно вывести в консоль таблицу умножения в формате 9 на 9. Сделать это можно при помощи вложенных циклов for. Один цикл создает строки, а другой столбцы.","Дана строка word = Python. Напишите цикл, который выведет каждую букву этой строки на отдельной строке."],
    "while": ['запросите у пользователя число n. С помощью цикла while найдите сумму всех чисел от 1 до n.','Напишите программу, которая выводит числа от 1 до 10, используя цикл while","Программа "загадывает" число (например, secret = 7). Пользователь вводит числа, пока не угадает. После каждой неудачной попытки выводите подсказку "Больше" или "Меньше". Когда число угадано, выведите "Поздравляю! Вы угадали!" и количество попыток.'],
    "datatypes": ["task 1 datatype","task 2 datatype","task 3 datatype"],
    "strings": ["task 1 string","task 2 string","task 3 string"]
}

theory = {
    "if else": 'Условия *if/else* в Python — это конструкция для принятия решений в программе. Она позволяет выполнять разные блоки кода в зависимости от истинности условий.\n*Основные элементы:*\n*1.if* — проверяет условие, если оно истинно (True), выполняется блок кода после него\n*2.elif (else if)* — проверяет дополнительное условие, если предыдущие условия ложны\n*3.else* — выполняется, если все предыдущие условия ложны',
    "for": 'Оператор for..in также является оператором цикла, который осуществляет итерацию по последовательности объектов, т.е. проходит через каждый элемент в последовательности. Мы узнаем больше о последовательностях в дальнейших главах, а пока просто запомните, что последовательность – это упорядоченный набор элементов.',
    "while": 'Оператор while позволяет многократно выполнять блок команд до тех пор, пока выполняется некоторое условие. Это один из так называемых операторов цикла. Он также может иметь необязательный пункт else.',
    "datatypes": 'Типы данных в программировании — это характеристика данных, определяющая множество допустимых значений и операций над ними, а также способ их представления и хранения в памяти. Тип данных указывает на характер переменной и определяет, какие действия с ней можно выполнять.',
    "strings": 'Строка – это последовательность символов. Чаще всего строки – это просто некоторые наборы слов.'
}
